calm water resistance/KVLCC2/Fr0.1469/0.org/include/initialConditions
flowVelocity          (1.080726 0 0);
Umean                  1.080726;
turbulentKE            1.751954e-04;
turbulentOmega         9.794154e-01;
turbulentEpsilon       1.029534e-07;
turbulentNut           3.420000e-06;
transitionTu           1.000000e+00;
transitionLambdaTheta  0.000000e+00;
transitionFLambdaTheta 1.000000e+00;
transitionReThetat     5.843016e+02;
#inputMode       merge;