calm water resistance/KVLCC2/Fr0.1469/system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
	version    2.0;
	format     ascii;
	class      dictionary;
	object     blockMeshDict;
}

scale 1;

vertices
(
	(-11.113978320993164 0 -7.0639692718176885)
	(16.670967481489743 0 -7.0639692718176885)
	(16.670967481489743 8.00583184139338 -7.0639692718176885)
	(-11.113978320993164 8.00583184139338 -7.0639692718176885)
	(-11.113978320993164 0 2.8255877087270753)
	(16.670967481489743 0 2.8255877087270753)
	(16.670967481489743 8.00583184139338 2.8255877087270753)
	(-11.113978320993164 8.00583184139338 2.8255877087270753)
);

edges
(

);

blocks
(
	hex (0 1 2 3 4 5 6 7) (118 34 42) simpleGrading (1 1 1)
);

boundary
(
	inlet
	{
		type patch;
		faces
		(
			(0 4 7 3)
		);
	}
	sides
	{
		type patch;
		faces
		(
			(3 2 6 7)
			(0 3 2 1)
		);
	}
	midPlane
	{
		type symmetryPlane;
		faces
		(
			(0 1 5 4)
		);
	}
	outlet
	{
		type patch;
		faces
		(
			(2 6 5 1)
		);
	}
	top
	{
		type patch;
		faces
		(
			(4 5 6 7)
		);
	}
);

